test/artillery/join-session.yml
config:
  target: 'http://localhost:3001'
  phases:
    - duration: 10
      arrivalRate: 40
  defaults:
    headers:
      content-type: application/json
      authorization: 'Bearer eyJhbGciOiJSUzI1NiIsImtpZCI6IjhkOWJlZmQzZWZmY2JiYzgyYzgzYWQwYzk3MmM4ZWE5NzhmNmYxMzciLCJ0eXAiOiJKV1QifQ.eyJuYW1lIjoiUm9kb2xmbyIsImlzcyI6Imh0dHBzOi8vc2VjdXJldG9rZW4uZ29vZ2xlLmNvbS9xcmlvdXMtNTEzMTAiLCJhdWQiOiJxcmlvdXMtNTEzMTAiLCJhdXRoX3RpbWUiOjE3Mjg3ODEyMjgsInVzZXJfaWQiOiJkdzFiU0VmOFlXVm5lNTRNNmdXNUx3ZjhWM1MyIiwic3ViIjoiZHcxYlNFZjhZV1ZuZTU0TTZnVzVMd2Y4VjNTMiIsImlhdCI6MTcyODgyODcxMywiZXhwIjoxNzI4ODMyMzEzLCJlbWFpbCI6InJvZG9sZm9AZ21haWwuY29tIiwiZW1haWxfdmVyaWZpZWQiOmZhbHNlLCJmaXJlYmFzZSI6eyJpZGVudGl0aWVzIjp7ImVtYWlsIjpbInJvZG9sZm9AZ21haWwuY29tIl19LCJzaWduX2luX3Byb3ZpZGVyIjoicGFzc3dvcmQifX0.AtVSLrl_HQk9DH9SpYuiSKbv0oNUVQ591SO_DXVjP5TcYVzyR2n1U1bpj-w9ME2hNIX3agXrgDKKjvStajCjU0rv3Gf9Uxq_SCSy63j0jSedgK8U9R1qrppwElmk_hezJaxqNg6iGBp9z_yfgW4upavYc5f3UnFUrJ0UXP5Q4NonNnf5ldLGitwJ9KCoGp89NuimlO0NSyEscAwcyrdibqjMVlbsTt7zzDAhYOT8tU8HGjR-9gXJ4_Htm2167DgqMzcufegZclX8kyqxtreevvg8anFGJI--LQTYnPOUJOPzaehfqxhMHnMbCvpAVYXY6NL8BmdoEgpytsakXWrsLw'
scenarios:
  - flow:
      - post:
          url: '/sessions/join'
          json:
            sessionCode: '404AAD'