test/artillery/user-register.yml
config:
  target: 'http://localhost:3001/auth'
  phases:
    - duration: 10
      arrivalRate: 40
scenarios:
  - flow:
      - post:
          url: '/register'
          json:
            email: 'user{{ $randomNumber(1000, 9999) }}@gmail.com'
            password: '123456'
            displayName: 'User {{ $randomNumber(1000, 9999) }}'